{-
Задание 1
    Вводим аргумент на выходе получаем значение заданой функции 
-}

-- № 151
solve_151 x = (x * x) / (1 + x)

-- № 152
solve_152 x = sqrt(3*x - x^3)

-- № 154a
solve_154a x = logBase 10 (x*x - 4)

-- № 165.3
solve_165_3 x = sqrt(sin(2*x)) - sqrt(sin(3 * x))

-- № 167
solve_167 x = logBase 10 (1 - 2 * cos(x))


{- 
Задание 2
    Подставляем аргументы все более близкие к значению предела
    и оцениваем полученные пределы
-}

-- № 411c
solve_411c n = (n^2 - 1)/(2*n^2 - n - 1)
{- 
    Ручной поиск предела последовательности solve_411c
    
    ghci> solve_411c 10  
    0.5238095238095238 
    
    ghci> solve_411c 1000
    0.5002498750624688
    
    ghci> solve_411c 1000000
    0.500000249999875

    ghci> solve_411c 1000000000
    0.50000000025

    ghci> solve_411c 10000000000000000
    0.5
    
    Ответ: 0.5
-}

-- № 431
chisl_431 n = sum([(2*x - 1)^2 | x <- [1..n]])
znam_431 n = sum([(2*x)^2 | x <- [1..n]]) 
solve_431 n = (chisl_431 n)/(znam_431 n)
{- 
    Ручной поиск предела последовательности solve_431
    
    ghci> solve_431 10                
    0.8636363636363636
    
    ghci> solve_431 10000
    0.9998500149985001
    
    ghci> solve_431 10000000
    0.9999998499988859

    Ответ: 1
-}

-- № 433
chisl_433 n = sum([(3*x - 2)^3 | x <- [1..n]])
znam_433 n = sum([(3*x - 2) | x <- [1..n]])^2
solve_433 n = (chisl_433 n)/(znam_433 n)
{- 
    Ручной поиск предела последовательности solve_433
    
    ghci> solve_433 10
    2.986206896551724
    
    ghci> solve_433 1000 
    2.999998666222074
    
    ghci> solve_433 1000000
    2.9999999999986313
    
    Ответ: 3
-}

-- № 411a
solve_411a x = (x^2 - 1)/(2*x^2 - x - 1)
{- 
    Ручной поиск предела функции solve_411a
    где x -> 0 
    
    Приближение справа
    ghci> solve_411a 0.1    
    0.9166666666666666
    
    ghci> solve_411a 0.001
    0.9990019960079839
    
    ghci> solve_411a 0.00001
    0.999990000199996

    Приближение слева
    ghci> solve_411a (-0.1)
    1.125
    
    ghci> solve_411a (-0.001)
    1.0010020040080159
    
    ghci> solve_411a (-0.00001)
    1.0000100002000039

    Ответ: 1
-}


-- № 411b
solve_411b x = (x^2 - 1)/(2*x^2 - x - 1)
{- 
    Ручной поиск предела функции solve_411b
    где x -> 1

    Приближение слева
    ghci> solve_411b 0.9        
    0.6785714285714286

    ghci> solve_411b 0.99
    0.6677852348993287

    ghci> solve_411b 0.9999999
    0.6666666777688977

    Приближение справа
    ghci> solve_411b 1.1
    0.65625

    ghci> solve_411b 1.01
    0.6655629139072848

    ghci> solve_411b 1.0000001
    0.6666666555644372
   
    Ответ: 2/3
-}



{-
Задание 3
    Вычисляем предел с заданной точностью 
    заранее зная реальный предел 
    
    eps - заданая точность
-}

{-Решение для 411c-}
-- знаем, что предел этой последовательности равен 0.5

-- check_411c ищет предел с заданной точностью для этого 
-- проверяем выполняется ли условие из определения 
-- предела последовательности: abs(xn - L) < eps 
-- где L - известный нам предел, а eps заданая точность
check_411c n eps = 
    if abs(solve_411c n - 0.5) < eps
        then solve_411c n
        else check_411c (n + 1) eps 

limit_411c eps = 
    check_411c 1 eps 
{-
Проверка работы limit_411c
    ghci> limit_411c 0.01 
    0.5098039215686274

    ghci> limit_411c 0.00001  
    0.500009999800004

    Проверка:
    
    0.5098039215686274 - 0.5 = 
    0.0098039215686274 < 0.01 
    Верно

    0.500009999800004 - 0.5 =
    0.000009999800004 < 0.00001 
    Верно
-}

{-Решение для 411b-}
-- знаем, что предел этой функции при x -> 1 равен 2/3

-- check411b ищет предел с заданой точностью для этого 
-- проверяем выполнется ли условие из определения 
-- предела функции по Коши: abs(f(x) - L) < eps 
-- где L - извесный нам предел, а eps заданая точность
check_411b x eps = 
    if abs (solve_411b (1 - 1 / x) - (2 / 3)) < eps
        then solve_411b (1 - 1 / x)
        else check_411b (x + 1) eps

limit_411b eps =
    check_411b 1 eps
{-
Проверка работы limit_411b
    
    ghci> limit_411b 0.01 
    0.676470588235294
    
    ghci> limit_411b 0.0001
    0.6667666466706634

    Проверка:
    ghci> 2 / 3
    0.6666666666666666

    0.676470588235294 - 0.6666666666666666 = 
    0.0098039215686274 < 0.01 
    Верно

    0.6667666466706634 - 0.6666666666666666 =
    0.0000999800039968 < 0.0001 
    Верно
-}



{-
Задание №4
    Автоматически вычисляем предел с заданной точностью 
    не зная реальное значение предела
-}

-- auto_check411c ищет предел с заданой точностью для этого
-- cравниваем два последовательных значения последовательности.
-- Если их разность по модулю меньше eps,
-- считаем, что мы нашли предел с заданой точностью

auto_check411c x eps = 
    if abs (solve_411c (x + 1) - solve_411c x) < eps
        then solve_411c x
        else auto_check411c (x + 1) eps

find_limit411c eps = 
    auto_check411c 1 eps 

{-
Проверка работы find_limit411c
    ghci> find_limit411c 0.01
    0.5454545454545454
    
    ghci> find_limit411c 0.001
    0.5161290322580645
    
    ghci> find_limit411c 0.0001
    0.504950495049505
-}